wuyajundeyouxiang/Geek_HNB_HC32F005/main.c
/******************************************************************************
* Copyright (C) 2018, Huada Semiconductor Co.,Ltd All rights reserved.
*
* This software is owned and published by:
* Huada Semiconductor Co.,Ltd ("HDSC").
*
* BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
* BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
*
* This software contains source code for use with HDSC
* components. This software is licensed by HDSC to be adapted only
* for use in systems utilizing HDSC components. HDSC shall not be
* responsible for misuse or illegal use of this software for devices not
* supported herein. HDSC is providing this software "AS IS" and will
* not be responsible for issues arising from incorrect user implementation
* of the software.
*
* Disclaimer:
* HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
* REGARDING THE SOFTWARE (INCLUDING ANY ACOOMPANYING WRITTEN MATERIALS),
* ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
* WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
* WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
* WARRANTY OF NONINFRINGEMENT.
* HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
* NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
* LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
* LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
* INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
* INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
* SAVINGS OR PROFITS,
* EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
* INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
* FROM, THE SOFTWARE.
*
* This software may be replicated in part or whole for the licensed use,
* with the restriction that this Disclaimer and Copyright notice must be
* included with each copy of this software, whether used in part or whole,
* at all times.
*/
/******************************************************************************/
/** \file main.c
 **
 ** A detailed description is available at
 ** @link Sample Group Some description @endlink
 **
 **   - 2018-05-08  1.0  Lux First version for Device Driver Library of Module.
 **
 ******************************************************************************/

/******************************************************************************
 * Include files
 ******************************************************************************/
#include "bt.h"
#include "gpio.h"
#include "hc32f005.h"
#include "sysctrl.h"
#include "stdint.h"

#include "adt.h"
#include "flash.h"
#include "mycommon.h"
#include "adc.h"
#include "bgr.h"
#include "uart.h"
/******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/******************************************************************************
 * Local variable definitions ('static')                                      *
 ******************************************************************************/

/******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*****************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
 
#define LED1PORT	GpioPort2       //GpioPort1 //GpioPort0
#define LED1PIN		GpioPin5        //GpioPin4	//GpioPin1
#define LED2PORT	GpioPort2       //GpioPort2 //GpioPort0//
#define LED2PIN		GpioPin4        //GpioPin4 //GpioPin2//
#define KEYPORT		GpioPort3
#define KEYPIN		GpioPin6
#define MOTOR_PORT	GpioPort3
#define MOTOR_PIN	GpioPin5
#define USB_PORT	GpioPort1
#define USB_PIN		GpioPin5
#define CHR_PORT	GpioPort1
#define CHR_PIN		GpioPin4
#define T_CHE_PORT  GpioPort2
#define T_CHE_PIN   GpioPin6
#define PWM_PORT    GpioPort3                    //GpioPort3,GpioPin4,GpioAf5
#define PWM_PIN     GpioPin2                    //
#define PWM_AFX     GpioAf3
#define PWM_TIMX    M0P_ADTIM6                  //PWM_TIMX M0P_ADTIM4
#define PWM_CHX     GCMBR
#define PWM_CMPX    AdtCompareB
#define PWM_AdtCHx  AdtCHxB                     //GCMAR
#define ADC_CHx     AdcExInputCH4

#define VOLTAGE_L	3300

#define adcLen	4
static uint16_t index = 0;
static uint16_t adcResult_Temp[adcLen]={0}; 
static uint32_t adcResult_Sum = 0;
static uint16_t adcAve = 0;
static uint16_t bFullFlag = 0;


typedef struct {
	int flag;
	int cnt;
	int MaxCnt;
} MOTORFLAG;
MOTORFLAG gMotor;
static volatile uint32_t u32BtTestFlag = 0;
static volatile uint32_t u32Cnt = 0;

static void App_LedInit(void);
void iniPwm(void);
void iniTemperature(void);
void delay(uint32_t u32Cnt);
static void _UartBaudCfg(void);
void Led1On(void);
void Led1Off(void);
void Led2On(void);
void Led2Off(void);
void sendChar(char);
void sendStr(char* pStr);
void sendIntStr(int num);
void getBatVol(void);
void blink_LedALL(int num);

void Timer_Init(void)
{
	stc_bt_cfg_t   		stcCfg;
    en_result_t       enResult = Error;
    uint16_t          u16ArrData = 0xFE88; //0x8000;
    uint16_t          u16InitCntData = 0xFE88;
    
    Sysctrl_SetPeripheralGate(SysctrlPeripheralBt, TRUE);

    stcCfg.enGateP = BtPositive;
    stcCfg.enGate  = BtGateDisable;
    stcCfg.enPRS   = BtPCLKDiv64;
    stcCfg.enTog   = BtTogDisable;
    stcCfg.enCT    = BtTimer;
    stcCfg.enMD    = BtMode2;
    
    if (Ok != Bt_Init(TIM0, &stcCfg))
    {
        enResult = Error;
    }
    
    Bt_ClearIntFlag(TIM0);
    Bt_EnableIrq(TIM0);
    EnableNvic(TIM0_IRQn, IrqLevel3, TRUE);
    
    Bt_ARRSet(TIM0, u16ArrData);
    Bt_Cnt16Set(TIM0, u16InitCntData);
    Bt_Run(TIM0);
}

void SetSysClock24M(void)
{		
	M0P_SYSCTRL->SYSCTRL2 = 0X5A5A;
	M0P_SYSCTRL->SYSCTRL2 = 0XA5A5;
	M0P_SYSCTRL->SYSCTRL0_f.HCLK_PRS = 7;
													
