wuyajundeyouxiang/Geek_HNB_HC32F005/main.c
	M0P_SYSCTRL->RCH_CR = *((uint16_t *)( 0X00100C08 ) ); //4M
	M0P_SYSCTRL->RCH_CR = *((uint16_t *)( 0X00100C06 ) ); //8M
	M0P_SYSCTRL->RCH_CR = *((uint16_t *)( 0X00100C04 ) ); //16M
	M0P_SYSCTRL->RCH_CR = *((uint16_t *)( 0X00100C00 ) ); //24M
	M0P_SYSCTRL->SYSCTRL2 = 0X5A5A;
	M0P_SYSCTRL->SYSCTRL2 = 0XA5A5;
	M0P_SYSCTRL->SYSCTRL0_f.HCLK_PRS = 0;
}

void App_AdvTimerInit(uint16_t u16Period, uint16_t u16CHA_PWMDuty, uint16_t u16CHB_PWMDuty)
{
    en_adt_compare_t          enAdtCompareA;
    en_adt_compare_t          enAdtCompareB;
	en_adt_compare_t          enAdtCompareX;


    stc_adt_basecnt_cfg_t     stcAdtBaseCntCfg;
    stc_adt_CHxX_port_cfg_t   stcAdtTIMACfg;
    stc_adt_CHxX_port_cfg_t   stcAdtTIMBCfg;
    stc_adt_CHxX_port_cfg_t   stcAdtTIMXCfg;
    
    DDL_ZERO_STRUCT(stcAdtBaseCntCfg);
    DDL_ZERO_STRUCT(stcAdtTIMACfg);
    DDL_ZERO_STRUCT(stcAdtTIMBCfg);
    DDL_ZERO_STRUCT(stcAdtTIMXCfg);
    

    Sysctrl_SetPeripheralGate(SysctrlPeripheralAdvTim, TRUE);       //ADT外设时钟使能
    
    stcAdtBaseCntCfg.enCntMode = AdtSawtoothMode;                   //锯齿波模式
    stcAdtBaseCntCfg.enCntDir = AdtCntDown;
    stcAdtBaseCntCfg.enCntClkDiv = AdtClkPClk0Div1024;
    
    Adt_Init(PWM_TIMX, &stcAdtBaseCntCfg);                        //ADT载波、计数模式、时钟配置
    
    Adt_SetPeriod(PWM_TIMX, u16Period);                           //周期设置
    
//    enAdtCompareA = AdtCompareA;
//    Adt_SetCompareValue(PWM_TIMX, enAdtCompareA, u16CHA_PWMDuty);  //通用比较基准值寄存器A设置
    
//    enAdtCompareB = AdtCompareB;
//    Adt_SetCompareValue(PWM_TIMX, enAdtCompareB, u16CHB_PWMDuty);  //通用比较基准值寄存器B设置
	enAdtCompareX = PWM_CMPX;
	Adt_SetCompareValue(PWM_TIMX, enAdtCompareX, u16CHA_PWMDuty);  //通用比较基准值寄存器A设置		
    
    stcAdtTIMXCfg.enCap = AdtCHxCompareOutput;            	    //比较输出
    stcAdtTIMXCfg.bOutEn = TRUE;                          	    //CHA输出使能
    stcAdtTIMXCfg.enPerc = AdtCHxPeriodLow;               	    //计数值与周期匹配时CHA电平保持不变
    stcAdtTIMXCfg.enCmpc = AdtCHxCompareInv;             	    //CHx端口输出设定为高电平   //计数值与比较值A匹配时，CHA电平翻转
    stcAdtTIMXCfg.enStaStp = AdtCHxStateSelSS;            	    //CHA起始结束电平由STACA与STPCA控制
    stcAdtTIMXCfg.enStaOut = AdtCHxPortOutLow;                  //AdtCHxPortOutHigh;            //CHA起始电平为低
    stcAdtTIMXCfg.enStpOut = AdtCHxPortOutLow;            	    //CHA结束电平为低
    Adt_CHxXPortCfg(PWM_TIMX, PWM_AdtCHx, &stcAdtTIMXCfg);  	//端口CHA配置    
}

void App_AdvTimerPortInit(void)
{
    stc_gpio_cfg_t         stcTIM4Port;
    
    DDL_ZERO_STRUCT(stcTIM4Port);
    
    Sysctrl_SetPeripheralGate(SysctrlPeripheralGpio, TRUE); //端口外设时钟使能
    
    stcTIM4Port.enDir  = GpioDirOut;
    //P34设置为TIM4_CHA
    Gpio_Init(PWM_PORT, PWM_PIN, &stcTIM4Port);           //PWM_PORT
    Gpio_SetAfMode(PWM_PORT,PWM_PIN,PWM_AFX);

    //P35设置为TIM4_CHB
    //Gpio_Init(GpioPort3, GpioPin5, &stcTIM4Port);
    //Gpio_SetAfMode(GpioPort3,GpioPin5,GpioAf5);  
}

void LED_Init(void)
{
	stc_gpio_cfg_t stcGpioCfg;
	Sysctrl_SetPeripheralGate(SysctrlPeripheralGpio, TRUE);    
	stcGpioCfg.enDir = GpioDirOut;
	stcGpioCfg.enPu = GpioPuDisable;
	stcGpioCfg.enPd = GpioPdDisable;    
	Gpio_Init(LED1PORT, LED1PIN, &stcGpioCfg);	
	Gpio_Init(LED2PORT, LED2PIN, &stcGpioCfg);
	Led1On();
	Led2On();
	
	//delay1ms(1000);
	delay(1000);
	Led1Off();
	Led2Off();
/*
    Gpio_Init(GpioPort3, GpioPin2, &stcGpioCfg);
    Gpio_WriteOutputIO(GpioPort3, GpioPin2, TRUE);
    while(1)
    {
       delay(1000);
       Gpio_WriteOutputIO(GpioPort3, GpioPin2, TRUE);
       delay(1000);
       Gpio_WriteOutputIO(GpioPort3, GpioPin2, FALSE);
    };*/
}

void Key_Init(void)
{
	stc_gpio_cfg_t stcGpioCfg;    
    Sysctrl_SetPeripheralGate(SysctrlPeripheralGpio, TRUE);
    stcGpioCfg.enDir = GpioDirIn;
    stcGpioCfg.enDrv = GpioDrvL;
    stcGpioCfg.enPu  = GpioPuEnable;
    stcGpioCfg.enPd  = GpioPdDisable;
    stcGpioCfg.enOD  = GpioOdDisable;
    Gpio_Init(KEYPORT, KEYPIN, &stcGpioCfg); 
}

#define KEY_STATE_0                         0           
#define KEY_STATE_1                         1
#define KEY_STATE_2                         2
#define KEY_STATE_3                         3
#define KEY_STATE_4                         4
#define KEY_STATE_5                         5
#define KEY_STATE_6                         6

#define SINGLE_KEY_TIME                     3       	//  SINGLE_KEY_TIME*10MS = 30MS  
#define KEY_INTERVAL                        40      	//  KEY_INTERVAL*10MS    = 400MS 
#define LONG_KEY_TIME                       100      	//  LONG_KEY_TIME*10MS   = 600mS 
#define TIM_1S                              1000




unsigned char key_driver(void) 
{     
    static unsigned char key_state = 0;
    static unsigned int  key_time = 0;
    unsigned char key_press, key_return; 

    key_return = N_KEY;                         //  ?? ?????

    key_press = Gpio_GetInputIO(KEYPORT, KEYPIN);

    switch (key_state)     
    {       
        case KEY_STATE_0:                       //  ????0:????????
            if (!key_press)                     //  ?????
            {
                key_time = 0;                   //  ????????
                key_state = KEY_STATE_1;        //  ???? ????1
            }        
            break;
        case KEY_STATE_1:                       //  ????1:????(????????,?????)????????:????????????????
            if (!key_press)                     
            {
                key_time++;                     //  ??10ms
                if(key_time>=SINGLE_KEY_TIME)   //  ?????:SINGLE_KEY_TIME*10ms = 30ms;
                {
                    key_state = KEY_STATE_2;    //  ???????? ????,????????????????????:??????,?? ????2, ?????????????
                }
            }         
            else key_state = KEY_STATE_0;       //  ??????????,?????,????,?? ????0,??????
            break;
        case KEY_STATE_2:                       //  ????2:?????????:???,????
            if(key_press)                       //  ????? ??????? ???,??????
            { 
                 key_return = S_KEY;            //  ?? ?????:??
                 key_state = KEY_STATE_0;       //  ?? ????0,??????
            } 
            else
            {
                key_time++;                     

                if(key_time >= LONG_KEY_TIME)   //  ???????? ???????(LONG_KEY_TIME*10ms=300*10ms=3000ms), ???? ??
                {
                    key_return = L_KEY;         //  ?? ?????:??
                    key_state = KEY_STATE_3;    //  ???3,??????
                    //sendMsg(L_KEY);
                    //Led1On();
                }
            }
            break;
      case KEY_STATE_3:                         
          if (key_press) 
          {
              key_state = KEY_STATE_0;          
          }        
          break;
        default:                               
            key_state = KEY_STATE_0;
            break;
    }
    return  key_return;                         
} 

unsigned char key_read(void)                            
{ 
    static unsigned char key_state1=0, key_time1=0;
    unsigned char key_return,key_temp;
    key_return = N_KEY;
    key_temp = key_driver();

