wuyajundeyouxiang/Geek_HNB_HC32F005/main.c
    switch(key_state1) 
    {         
        case KEY_STATE_0:
            if (key_temp == S_KEY )
            { 
                 key_time1 = 0;
                 key_state1 = KEY_STATE_1;
            }             
            else
            {
                 key_return = key_temp;
            }
            break;
        case KEY_STATE_1:
            if (key_temp == S_KEY)
            {                 
                 key_time1 = 0;                 
                 key_state1 = KEY_STATE_2;
            } 
            else
            {
                key_time1++;
                if(key_time1 >= KEY_INTERVAL)
                 { 
                      key_return = S_KEY;					  
                      key_state1 = KEY_STATE_0;
                 }              
             }              
             break;
         case KEY_STATE_2:
            if (key_temp == S_KEY)
            {                 
                 key_time1 = 0;                 
                 key_state1 = KEY_STATE_3;
            } 
            else
            {
                key_time1++;
                if(key_time1 >= KEY_INTERVAL)
                 { 
                      key_return = D_KEY;
                      key_state1 = KEY_STATE_0;
                 }              
             }              
             break;
         case KEY_STATE_3:
            if (key_temp == S_KEY)
            {                 
                 key_time1 = 0;                 
                 key_state1 = KEY_STATE_4;
            } 
            else
            {
                key_time1++;
                if(key_time1 >= KEY_INTERVAL)
                 { 
                      key_return = T_KEY;
                      key_state1 = KEY_STATE_0;
                 }              
             }              
             break;
         case KEY_STATE_4:
            if (key_temp == S_KEY)
            {                 
                 key_time1 = 0;                 
                 key_state1 = KEY_STATE_5;
            } 
            else
            {
                key_time1++;
                if(key_time1 >= KEY_INTERVAL)
                 { 
                      key_return = Q_KEY;
                      key_state1 = KEY_STATE_0;
                 }              
             }              
             break;
         case KEY_STATE_5:
            if (key_temp == S_KEY)
            {                 
                 key_return = Six_KEY;                 
                 key_state1 = KEY_STATE_0;
            } 
            else
            {
                key_time1++;
                if(key_time1 >= KEY_INTERVAL)
                 { 
                      key_return = F_KEY;
                      key_state1 = KEY_STATE_0;
                 }              
             }              
             break;
        default:
            key_state1 = KEY_STATE_0;
            break;
    }
    return key_return;
}

static uint16_t u16AdcResult;
static uint16_t u16AdcResult_Temp;

stc_adc_cfg_t      stcAdcCfg;
stc_adc_norm_cfg_t stcAdcNormCfg; 

void iniBatVol(void)
{/*
	stc_gpio_cfg_t stcGpioCfg;
    Sysctrl_SetPeripheralGate(SysctrlPeripheralGpio, TRUE);
    stcGpioCfg.enDir = GpioDirOut;
    stcGpioCfg.enPu = GpioPuDisable;
    stcGpioCfg.enPd = GpioPdDisable;
    Gpio_Init(GpioPort1, GpioPin4, &stcGpioCfg);
	Gpio_WriteOutputIO(GpioPort1, GpioPin4, FALSE);
	Sysctrl_SetPeripheralGate(SysctrlPeripheralGpio, TRUE);
    Sysctrl_SetPeripheralGate(SysctrlPeripheralAdcBgr, TRUE);

	/////////////////
	Sysctrl_SetPeripheralGate(SysctrlPeripheralGpio, TRUE);

    Gpio_SetAnalogMode(GpioPort2, GpioPin4);
    Gpio_SetAnalogMode(GpioPort2, GpioPin6);*/
	/////////////////


	/////////////////
    
    //ADC??
    Sysctrl_SetPeripheralGate(SysctrlPeripheralAdcBgr, TRUE);
    Adc_Enable();
    Bgr_BgrEnable();   
    stcAdcCfg.enAdcOpMode = AdcNormalMode;
    stcAdcCfg.enAdcClkSel = AdcClkSysTDiv8;
    stcAdcCfg.enAdcSampTimeSel = AdcSampTime4Clk;
    stcAdcCfg.enAdcRefVolSel = RefVolSelInBgr1p5;
    stcAdcCfg.bAdcInBufEn = TRUE;
    stcAdcCfg.u32AdcRegHighThd = 0u;
    stcAdcCfg.u32AdcRegLowThd = 0u;
    stcAdcCfg.enAdcTrig0Sel = AdcTrigDisable;
    stcAdcCfg.enAdcTrig1Sel = AdcTrigDisable;
    Adc_Init(&stcAdcCfg);

	stcAdcNormCfg.enAdcNormModeCh = AdcAVccDiV3Input;
    stcAdcNormCfg.bAdcResultAccEn = FALSE;
    Adc_ConfigNormMode(&stcAdcCfg, &stcAdcNormCfg);
	
}

uint8_t u8RxData[2] = {0x55,0x00};
void Uart0_IRQHandler(void)
{
    if(TRUE == Uart_GetStatus(M0P_UART1, UartRC))
    {
        Uart_ClrStatus(M0P_UART1, UartRC);

        u8RxData[1] = Uart_ReceiveData(M0P_UART0);
        //u8RxFlg = 1;
    }
}

void iniUart(void)
{
	stc_gpio_cfg_t stcGpioCfg;
    DDL_ZERO_STRUCT(stcGpioCfg);	
    Sysctrl_SetPeripheralGate(SysctrlPeripheralGpio,TRUE); //??GPIO????
//Sysctrl_SetFunc(SysctrlEXTHEn,FALSE);
    ///<TX
    stcGpioCfg.enDir = GpioDirOut;
    Gpio_Init(GpioPort0, GpioPin1, &stcGpioCfg);	

    ///<RX
    stcGpioCfg.enDir = GpioDirIn;
    Gpio_Init(GpioPort0, GpioPin2, &stcGpioCfg);	
	Gpio_SetAfMode(GpioPort0, GpioPin1, GpioAf3);          //??P01 ???URART1_RX
    Gpio_SetAfMode(GpioPort0, GpioPin2, GpioAf3);          //??P02 ???URART1_TX

	stc_uart_cfg_t  stcCfg;
    _UartBaudCfg();
    stcCfg.enRunMode = UartMode1;
    Uart_Init(M0P_UART1, &stcCfg);
   
    Uart_EnableIrq(M0P_UART1, UartRxIrq);
    Uart_ClrStatus(M0P_UART1, UartRC);
    EnableNvic(UART1_IRQn, IrqLevel3, TRUE);
}

void Motor_Init(void)
{
	gMotor.flag= 1;
	gMotor.MaxCnt= 2;
	gMotor.cnt=0;

	stc_gpio_cfg_t stcGpioCfg;
	Sysctrl_SetPeripheralGate(SysctrlPeripheralGpio, TRUE);    
	stcGpioCfg.enDir = GpioDirOut;
	stcGpioCfg.enPu = GpioPuDisable;
	stcGpioCfg.enPd = GpioPdEnable;    
	Gpio_Init(MOTOR_PORT, MOTOR_PIN, &stcGpioCfg);
	Gpio_WriteOutputIO(MOTOR_PORT, MOTOR_PIN, FALSE);
}

void openMotor(void)
{
	Gpio_WriteOutputIO(MOTOR_PORT, MOTOR_PIN, TRUE);
}

void closeMotor(void)
{
	Gpio_WriteOutputIO(MOTOR_PORT, MOTOR_PIN, FALSE);
}

void iniCharge(void)
{
	stc_gpio_cfg_t stcGpioCfg;    
    Sysctrl_SetPeripheralGate(SysctrlPeripheralGpio, TRUE);
    stcGpioCfg.enDir = GpioDirIn;
    stcGpioCfg.enDrv = GpioDrvL;
    stcGpioCfg.enPu  = GpioPuEnable;
    stcGpioCfg.enPd  = GpioPdDisable;
    stcGpioCfg.enOD  = GpioOdDisable;
    Gpio_Init(USB_PORT, USB_PIN, &stcGpioCfg);
	
    Sysctrl_SetPeripheralGate(SysctrlPeripheralGpio, TRUE);
    stcGpioCfg.enDir = GpioDirIn;
    stcGpioCfg.enDrv = GpioDrvL;
    stcGpioCfg.enPu  = GpioPuEnable;
    stcGpioCfg.enPd  = GpioPdDisable;
    stcGpioCfg.enOD  = GpioOdDisable;
    Gpio_Init(CHR_PORT, CHR_PIN, &stcGpioCfg);
}

void scanInputPower(void)
{
	static int cnt1 = 0;
	static int cnt2 = 0;
	static int cnt3 = 0;
	static int cnt4 = 0;
	if(Gpio_GetInputIO(USB_PORT, USB_PIN))
	{			
		cnt1=0;
		cnt2++;
		if(cnt2>=2)
		{
			cnt2 = 0;
			sendStr("TIP:CHG_UNPLUG");
			sendMsg(CHG_UNPLUG);
		}
	}
	else
	{
		cnt2=0;
		cnt1++;
		if(cnt1>=2)
		{
			cnt1 = 0;
			sendStr("TIP:CHG_PLUG");
			sendMsg(CHG_PLUG);

			if(Gpio_GetInputIO(CHR_PORT, CHR_PIN))
			{			
				cnt3=0;
				cnt4++;
				if(cnt4>=2)
				{
					cnt4 = 0;
					sendStr("TIP:CHG_NOFULL");
					sendMsg(CHG_NOFULL);
				}
			}
			else
			{
				cnt4=0;
				cnt3++;
				if(cnt3>=2)
				{
					cnt3 = 0;
					sendStr("TIP:CHG_FULL");
					sendMsg(CHG_FULL);
				}
			}
		}
	}
}

void App_Init(void)
{
	SetSysClock24M();
	Sysctrl_SetRCHTrim(SysctrlRchFreq24MHz);
	SystemCoreClockUpdate();

	Timer_Init();
	LED_Init();		
	Key_Init();
	Motor_Init();
	
	iniPwm();
	iniTemperature();
	iniBatVol();
	iniCharge();

	iniUart();
	state = standby;
}

unsigned char 			g1MS_Cnt  		= 0;
unsigned char 			g100MS_Cnt		= 0;
unsigned char 			g200MS_Cnt		= 0;
unsigned char 			g500MS_Cnt		= 0;
unsigned char 			g1000MS_Cnt		= 0;
volatile unsigned char 	gFlag10ms		= 0;
volatile unsigned char 	gFlag100ms		= 0;
volatile unsigned char 	gFlag200ms		= 0;
volatile unsigned char 	gFlag500ms		= 0;
volatile unsigned char 	gFlag1000ms		= 0;
volatile unsigned long  gTime0Count  	= 0;
unsigned long  			gstartTime	  	= 0;


