wuyajundeyouxiang/Geek_HNB_HC32F005/main.c
void testLed(void);

void changePwmDuty(uint16_t u16CHX_PWMDuty)
{
	PWM_TIMX->PWM_CHX = u16CHX_PWMDuty;
}

void testPwm(void);

void delay(uint32_t u32Cnt)
{
	unsigned long oldtime = gTime0Count;
	while(gTime0Count - oldtime < u32Cnt);
}

void Tim0_IRQHandler(void)
{
    if (TRUE == Bt_GetIntFlag(TIM0))
    {
        Bt_ClearIntFlag(TIM0);
			
		++g1MS_Cnt;
		++gTime0Count;
		if(g1MS_Cnt >= 10)
		{						
			g1MS_Cnt    = 0;
			gFlag10ms   = 1;
			++g100MS_Cnt;
			if(g100MS_Cnt >= 10)
			{	
				++g200MS_Cnt;
				if(g200MS_Cnt>=2)
				{
					g200MS_Cnt=0;
					gFlag200ms=1;
				}
				++g500MS_Cnt;
				if(g500MS_Cnt>=5)
				{
					g500MS_Cnt=0;
					gFlag500ms=1;
				}
				g100MS_Cnt = 0;
				gFlag100ms = 1;
				++g1000MS_Cnt;			
				if(g1000MS_Cnt>=10)
				{
					g1000MS_Cnt = 0;
					gFlag1000ms = 1;
					//testLed();
				}
			}
		}
    }
}

void Uart1_IRQHandler(void)
{
    if(TRUE == Uart_GetStatus(M0P_UART1, UartRC))
    {
        Uart_ClrStatus(M0P_UART1, UartRC);

        u8RxData[1] = Uart_ReceiveData(M0P_UART1);
//        u8RxFlg = 1;
    }
}


static int flag = 0;
void testLed(void)
{		
	if(flag==0)
	{
		Led1On();
		Led2On();
		flag = 1;
	}
	else
	{
		Led1Off();
		Led2Off();
		flag = 0;
	}		
}

void led01_test(void)
{		
	if(flag==0)
	{
		Led1Off();
		flag = 1;
	}
	else
	{
		Led1On();
		flag = 0;
	}		
}


void Led1On(void)
{
	Gpio_WriteOutputIO(LED1PORT, LED1PIN, FALSE);
}

void Led2On(void)
{
	Gpio_WriteOutputIO(LED2PORT, LED2PIN, FALSE);
}

void Led1Off(void)
{
	Gpio_WriteOutputIO(LED1PORT, LED1PIN, TRUE);
}

void Led2Off(void)
{
	Gpio_WriteOutputIO(LED2PORT, LED2PIN, TRUE);
}

void LedAllOff(void)
{
	Led1Off();
	Led2Off();
}

void iniTemperature(void)
{
	stc_gpio_cfg_t stcGpioCfg;
    Sysctrl_SetPeripheralGate(SysctrlPeripheralGpio, TRUE);    
    stcGpioCfg.enDir = GpioDirOut;
    stcGpioCfg.enPu = GpioPuDisable;
    stcGpioCfg.enPd = GpioPdDisable;    

    Gpio_Init(T_CHE_PORT, T_CHE_PIN, &stcGpioCfg);
	Gpio_WriteOutputIO(T_CHE_PORT, T_CHE_PIN, TRUE);//       GpioPort3   GpioPin5

    //////////////////
	Sysctrl_SetPeripheralGate(SysctrlPeripheralAdcBgr, TRUE);  //ADCBGR ??????
    Adc_Enable();
    Bgr_BgrEnable();   
    stcAdcCfg.enAdcOpMode = AdcNormalMode;
    stcAdcCfg.enAdcClkSel = AdcClkSysTDiv8;
    stcAdcCfg.enAdcSampTimeSel = AdcSampTime4Clk;
    stcAdcCfg.enAdcRefVolSel = RefVolSelInBgr1p5;
    stcAdcCfg.bAdcInBufEn = TRUE;
    stcAdcCfg.u32AdcRegHighThd = 0u;
    stcAdcCfg.u32AdcRegLowThd = 0u;
    stcAdcCfg.enAdcTrig0Sel = AdcTrigDisable;
    stcAdcCfg.enAdcTrig1Sel = AdcTrigDisable;
    Adc_Init(&stcAdcCfg);

	stcAdcNormCfg.enAdcNormModeCh = ADC_CHx;//AdcExInputCH4;//AdcExInputCH2;
    stcAdcNormCfg.bAdcResultAccEn = FALSE;
    Adc_ConfigNormMode(&stcAdcCfg, &stcAdcNormCfg);
    ///////////////////
}

void openTemperature(void)
{
	Gpio_WriteOutputIO(T_CHE_PORT, T_CHE_PIN, FALSE);
}

void closeTemperature(void)
{
	Gpio_WriteOutputIO(T_CHE_PORT, T_CHE_PIN, TRUE);
}


void checkTemperature(void)
{	
	getBatVol();
	
	openTemperature();
	stcAdcNormCfg.enAdcNormModeCh = ADC_CHx;
    stcAdcNormCfg.bAdcResultAccEn = FALSE;
    Adc_ConfigNormMode(&stcAdcCfg, &stcAdcNormCfg);
	
	delay1ms(1);
	Adc_Start();
    while(FALSE != Adc_PollBusyState());
    Adc_GetResult(&u16AdcResult_Temp);	
	closeTemperature();
	
	adcResult_Temp[index++] = u16AdcResult_Temp;
	if(index>=adcLen)
	{
		index=0;
		bFullFlag=1;
	}
	else
	{
		
	}
	adcResult_Sum += u16AdcResult_Temp;	
	
	if(bFullFlag)
	{
		adcAve = adcResult_Sum/adcLen;
		adcResult_Sum -= adcResult_Temp[index];
	}
	else
	{
		adcAve = adcResult_Sum/index;
	}
}


void getBatVol(void)
{
	stcAdcNormCfg.enAdcNormModeCh = AdcAVccDiV3Input;
    stcAdcNormCfg.bAdcResultAccEn = FALSE;
    Adc_ConfigNormMode(&stcAdcCfg, &stcAdcNormCfg);
	
	Adc_Start();
    while(FALSE != Adc_PollBusyState());
    Adc_GetResult(&u16AdcResult);
}

unsigned long regR 	= 0;
unsigned long regR1 = 0;

unsigned long vcc 	= 0;
unsigned long temv 	= 0;
unsigned long A = 0;
unsigned long B = 0;
unsigned long U = 0;
unsigned long I = 0;
volatile  uint16_t u16CHX_PWMDuty = 0;
void setPwmDuty(void);
//
#define targetA_base		1313	////1310//1346//1900//1313//1800//1400//1700//1900	//2000	//1120			// 6000
#define DELTA_PRE	16
#define DELTA_SMK	3
unsigned long targetA = targetA_base;
void adjustStep(int step)
{
	if(regR > targetA)
	{
		if(u16CHX_PWMDuty>step)
			u16CHX_PWMDuty-=step;
		state = smk;
		Led1Off();
		Led2On();
		gstartTime = gTime0Count;
	}				
	else
	{
		u16CHX_PWMDuty+=step;
		if(u16CHX_PWMDuty > 0x98)
		{
			u16CHX_PWMDuty = 0x98;
		}				
	}	
}

#define constDuty	30
void scan(void)
{    
    if(gFlag10ms)
    {
    	gFlag10ms = 0;
    	sendMsg(key_read());		
		
		if(state == smk)
		{
			checkTemperature();
			vcc = u16AdcResult*4500/4096;
			temv = u16AdcResult_Temp*1500*2/4096;
			U = vcc - temv;
			I = U / 10;
			regR = temv*1000/I;
		}			

		if(state == smk)
		{
			if(regR > targetA)
			{
				if(u16CHX_PWMDuty>DELTA_SMK)
					u16CHX_PWMDuty-=DELTA_SMK;
			}				
			else
			{
				u16CHX_PWMDuty+=DELTA_SMK;
				if(u16CHX_PWMDuty > 0x98/4*3)
				{
					u16CHX_PWMDuty = 0x98/4*3;
				}
			}	
			sendStr("X regR=");
			sendIntStr(regR);
//			u16CHX_PWMDuty = constDuty; 					// jackie
			PWM_TIMX->PWM_CHX = u16CHX_PWMDuty;	
		}					
	} 

	if(gFlag500ms)
	{
		gFlag500ms = 0;
	}
	
	if(gFlag200ms)
	{
		gFlag200ms = 0;
		if(gMotor.flag)
		{
			gMotor.cnt+=1;
			if(gMotor.cnt>gMotor.MaxCnt)
			{
				gMotor.flag 	= 0;
				gMotor.cnt 		= 0;
				gMotor.MaxCnt 	= 0;
				closeMotor();
			}
		}
		
		if(state == standby || state == charge)
		{
			scanInputPower();
		}		
		
		if(state == preHeat)
		{
			checkTemperature();
			vcc = u16AdcResult*4500/4096;
			temv = u16AdcResult_Temp*1500*2/4096;
			U = vcc - temv;
			I = U / 10;
			regR = temv*1000/I;
		  		
			if(regR > targetA && gTime0Count - gstartTime > 10000)					//&& gTime0Count - gstartTime > 10000
			{
				if(u16CHX_PWMDuty>DELTA_PRE)
					u16CHX_PWMDuty-=DELTA_PRE;
				state = smk;
				if(gMotor.flag==0)
				{
					gMotor.flag  = 1;
					gMotor.MaxCnt= 2;
					gMotor.cnt=0;
					openMotor();
				}
				Led1Off();
				Led2On();
				gstartTime = gTime0Count;
			}				
			else	
			{
				u16CHX_PWMDuty+=DELTA_PRE;
				if(u16CHX_PWMDuty > 150)
				{
					u16CHX_PWMDuty = 150;
				}				
			}
			
			sendStr("regR =");
			sendIntStr(regR);
			sendStr("PERAR =");
			sendIntStr(PWM_TIMX->PERAR);
//			u16CHX_PWMDuty = constDuty;                                 // jackie
			PWM_TIMX->PWM_CHX = u16CHX_PWMDuty;
			sendStr("PWM_CHX =");
			sendIntStr(PWM_TIMX->PWM_CHX);
    	}
	}		

	if(gFlag1000ms)
	{
		gFlag1000ms = 0;
		getBatVol();
/*
		checkTemperature();
		vcc = u16AdcResult*4500/4096;		
		//temv = u16AdcResult_Temp*1500*1190/510/4096;
		temv = u16AdcResult_Temp*1500*2/4096;
		U = vcc - temv;
		//I = U / 3;
		I = U / 10;
		regR = temv*1000/I;
		regR1 = 1071*1000*u16AdcResult_Temp/(459*u16AdcResult - 357*u16AdcResult_Temp);
		sendStr("VCC=");
		sendIntStr(vcc);
		sendStr("temv=");
		sendIntStr(temv);
		sendStr("regR=");
		sendIntStr(regR); 
*/
		sendStr("targetA=");
		sendIntStr(targetA);
 //       sendStr("VCC=");
//		sendIntStr(vcc);
		switch(state)
		{
			case sleepD:
				sendStr("state=sleepD\r\n");
				break;
			case sleep:
				sendStr("state=sleep\r\n");
				break;
			case standby:
				sendStr("state=standby\r\n");
				break;
			case smk:
				sendStr("state=smk\r\n");
				break;
			case charge:
				sendStr("state=charge\r\n");
				break;
			case preHeat:
				sendStr("state=preHeat\r\n");
				break;
			case debug:
				sendStr("state=debug\r\n");
				break;
			case upgrade:
				sendStr("state=upgrade\r\n");
				break;
			default:
				break;
		}
	}
}


void testPwm(void)
{
	if(flag==0)
	{
		changePwmDuty(0x3000);
		flag = 1;
	}
	else
	{
		changePwmDuty(0x6000);
		flag = 0;
	}	
}

void iniPwm(void)
{
	App_AdvTimerInit(0x0099, 0x0000, 0x0000);  		
    App_AdvTimerPortInit(); 
}

void startPwm(void)
{
	Adt_StartCount(PWM_TIMX);
}

void stopPwm(void)
{
	Adt_StopCount(PWM_TIMX);
}

void setPwmDuty(void)
{	
	PWM_TIMX->PWM_CHX = u16CHX_PWMDuty;
}

void clrPwmDuty()
{
	PWM_TIMX->PWM_CHX = 0;
}

