wuyajundeyouxiang/Geek_HNB_HC32F005/main.c
void blink_LedALL(int num)
{
	int i=0;
	for(i=0;i<num;i++)
	{
		Led1On();
		Led2On();
		delay(200);
		Led1Off();
		Led2Off();
		delay(200);
	}
}

void blink_Led1(int num)
{
	int i=0;
	for(i=0;i<num;i++)
	{
		Led1On();
		delay(200);
		Led1Off();
		delay(200);
	}
}

void blink_Led2(int num)
{
	int i=0;
	for(i=0;i<num;i++)
	{
		Led2On();
		delay(200);
		Led2Off();
		delay(200);
	}
}

void setIniCheckTemp(void)
{
	int i=0;	
	for(i=0;i<adcLen;i++)
	{
		adcResult_Temp[i] = 0;
	}
	index = 0;
	adcAve = 0;
	bFullFlag = 0;
	adcResult_Sum = 0;	
}

void standbyfun(void)
{ 
    double dBatVol = 0;
    switch(msg)
    {
    	case CHG_PLUG:
			Led1On();
			state = charge;
			break;
    	case F_KEY:
			blink_LedALL(1);
			state = sleep;
			break;
        case S_KEY:
			if(u16AdcResult > (VOLTAGE_L*4096/4500))
			{
				blink_Led2(3);
			}
			else
			{
				blink_Led1(3);
			}
			//sendChar('S');
			sendStr("s\r\n");
            break;
		case L_KEY:
			sendStr("L\r\n");			
			if(u16AdcResult > (VOLTAGE_L*4096/4500))
			{
				Led1On();
				if(gMotor.flag==0)
				{
					gMotor.flag  = 1;
					gMotor.MaxCnt= 2;
					gMotor.cnt=0;
					openMotor();
					sendStr("gMotor open");
				}				
				gstartTime = gTime0Count;
				u16CHX_PWMDuty = 72;
				setIniCheckTemp();
				setPwmDuty();
				startPwm();
				state = preHeat;
			}
			else
			{
				blink_LedALL(3);
			}			
			break;
        case T_KEY:
            //state = debug;
			//Led2On();
			targetA += 33;
			if(targetA > targetA_base + 33*1)
			{
				targetA = targetA_base;
			}
			blink_LedALL(1);
            break;
		case Q_KEY:
            state = upgrade;
			Led1On();
			Led2On();
            break;
        default:
            break;
    }
}




void preHeatfun(void)
{
    switch(msg)
    {
        case L_KEY:
            state = standby;
			sendStr("preHeatfun\r\n");	
            stopPwm();            
			Led1Off();
            break;
        default:
            break;
    }
}

void exitSmk(void)
{
	Led2Off();
	state=standby;
	stopPwm();
	sendStr("exitSmk\r\n");			
}

void smkfun(void)
{
	switch(msg)
	{
		case L_KEY:
			exitSmk();
			if(gMotor.flag==0)
			{
				gMotor.flag  = 1;
				gMotor.MaxCnt= 2;
				gMotor.cnt=0;
				openMotor();
			}
			break;
		case T_KEY:
            //state = debug;
			//Led2On();
			targetA += 33;
			if(targetA > targetA_base + 33*1)
			{
				targetA = targetA_base;
			}
			blink_LedALL(1);
			Led2On();
            break; 
		default:
			if(gTime0Count - gstartTime >= 240000)
			{
				exitSmk();
				if(gMotor.flag==0)
				{
					gMotor.flag  = 1;
					gMotor.MaxCnt= 2;
					gMotor.cnt=0;
					openMotor();
				}
			}
			break;
	}
}

/**
 ******************************************************************************
 ** \brief  Main function of project
 **
 ** \return uint32_t return value, if needed
 **
 ** This sample
 **
 ******************************************************************************/
void debugfun(void);
void upgradefun(void);

#define STRLEN	16
static char outstr[STRLEN]={0};
char* Itoa(unsigned int ni,int dd)
{
	int i = 0;
	char j=0,temp[16];
	unsigned int n,num=ni;
	
	while(num>=dd)
	{
		n=num%dd;
		if(n>9)
			temp[i]=n+0x37;
		else 
			temp[i]=n+0x30;
		num=num/dd;
		i++;
  }
  n=num;
	if(n>9)
		temp[i]=n+0x37;
	else 
		temp[i]=n+0x30;
  j=0;
  for(;i>=0;i--)
	{
		outstr[j]=temp[i];
		j++;
	}
  outstr[j++]='\r';
  outstr[j++]='\n';
  outstr[j]=0;
  return outstr;
}

void sendStr(char* pStr)
{
	int i=0;
	while(pStr[i])
	{
		Uart_SendDataPoll(M0P_UART1,pStr[i++]);
		delay(1);
	}
}

void sendChar(char c)
{
	Uart_SendDataPoll(M0P_UART1,c);
}

void sendIntStr(int num)
{	
	char*p = Itoa(num,10);
	sendStr(p);
}

void sleepfun(void)
{
	switch(msg)
	{
		case F_KEY:
			blink_LedALL(1);
			state = standby;
			sendStr("sleepfun\r\n");	
			break;
		default:
			break;
	}	
}

void chargefun(void)
{	
	switch(msg)
	{
		case CHG_UNPLUG:			
			LedAllOff();
			state = standby;
			sendStr("chargefun1\r\n");
			break;
		case CHG_FULL:
			Led1Off();
			Led2On();
			sendStr("chargefun2\r\n");
			break;
		case CHG_NOFULL:
			Led1On();
			Led2Off();
			sendStr("chargefun3\r\n");
			break;
		default:
			break;
	}	
}

void testFun(void)								
{
//	int i=0;
//	Itoa(18656,10);
//	while(outstr[i])
//	{
//		Uart_SendDataPoll(M0P_UART1,outstr[i++]);
//		delay(1);		
//	}		
	sendStr("66 ha ha !\r\n");
	sendIntStr(12546);
}
	
int32_t main(void)
{    
		App_Init();
//			u16CHX_PWMDuty = 0;
//			setPwmDuty();
//			startPwm();
    while(1)
    {
//			Uart_SendDataPoll(M0P_UART1,'W');
//			delay(1);
//			Uart_SendDataPoll(M0P_UART1,'D');
//			delay(1);
//			testFun();
		//if(Gpio_GetInputIO(KEYPORT, KEYPIN)==0)
		//{
		//	testLed();
		//}
		//else
		//{
			//testLed();
			//Uart_SendDataPoll(M0P_UART1,'A');
			//delay(1);
			
		//}
//		u16CHX_PWMDuty+=1;
//		if(u16CHX_PWMDuty>0x99)
//		{
//			u16CHX_PWMDuty=0;			
//		}
//		setPwmDuty();			
//		delay(1000);
		
    scan();
	msg=getMsg();
	switch(state)
    {
        case standby:
            standbyfun();
            break;
        case preHeat:
            preHeatfun();
            break;
		case smk:
            smkfun();
            break;
        case debug:
            debugfun();
            break;
		case upgrade:
			upgradefun();
			break;
		case sleep:
			sleepfun();
			break;
		case charge:
			chargefun();
			break;
        default:
            break;
    }	
    }
}

static void _UartBaudCfg(void)
{
    uint16_t timer=0;

    stc_uart_baud_cfg_t stcBaud;
    stc_bt_cfg_t stcBtCfg;

    DDL_ZERO_STRUCT(stcBaud);
    DDL_ZERO_STRUCT(stcBtCfg);

    //??????
    Sysctrl_SetPeripheralGate(SysctrlPeripheralBt,TRUE);//??0/2?????
    Sysctrl_SetPeripheralGate(SysctrlPeripheralUart1,TRUE);

    stcBaud.bDbaud  = 1u;//???????
    stcBaud.u32Baud = 19200u;//???????
    stcBaud.enMode  = UartMode1; //???????????
    stcBaud.u32Pclk = Sysctrl_GetPClkFreq(); //??PCLK
    timer = Uart_SetBaudRate(M0P_UART1, &stcBaud);

    stcBtCfg.enMD = BtMode2;
    stcBtCfg.enCT = BtTimer;
    Bt_Init(TIM1, &stcBtCfg);//??basetimer1?????????
    Bt_ARRSet(TIM1,timer);
    Bt_Cnt16Set(TIM1,timer);
    Bt_Run(TIM1);
}


void debugfun(void)
{
	switch(msg)
	{
		case T_KEY:
			Led2Off();
//			Sysctrl_SetFunc(SysctrlSWDUseIOEn,TRUE);			
//			Uart_SendDataPoll(M0P_UART0,'A');
//			Uart_SendDataPoll(M0P_UART0,'B');
			state = standby;
			sendStr("debugfun\r\n");
			break;
		default:
			break;
	}
}

void upgradefun(void)
{
	switch(msg)
	{
		case Q_KEY:
			Led2Off();
			Led1Off();
			Sysctrl_SetFunc(SysctrlSWDUseIOEn,FALSE);
			state = standby;
			sendStr("upgradefun\r\n");
			break;
		default:
			break;
	}
}

#undef adcLen




/******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/


